In [5]:
import numpy as np
import pandas as pd
path = 'C:/Users/Abdullah Rashid/Desktop/Data Analysis with Python Udemy Course/Pandas+Course+Resources/Pandas Course Resources/retail/oil.csv'
oil = pd.read_csv(path)
oil.columns=['date','prices'] # Columns names are changed to date and prices
oil

            date  prices
0     2013-01-01     NaN
1     2013-01-02   93.14
2     2013-01-03   92.97
3     2013-01-04   93.12
4     2013-01-07   93.20
...          ...     ...
1213  2017-08-25   47.65
1214  2017-08-28   46.40
1215  2017-08-29   46.46
1216  2017-08-30   45.96
1217  2017-08-31   47.26

[1218 rows x 2 columns]

In [6]:
oil.isna().sum()

date       0
prices    43
dtype: int64

In [10]:
mn = oil['prices'].fillna(0).mean()
mn

65.32379310344835

In [12]:
mn2 = oil['prices'].fillna(mn).mean()
mn2

67.62996970726466

In [14]:
oil.isna().sum()

date       0
prices    43
dtype: int64

In [18]:
oil.fillna({'prices':mn})

            date     prices
0     2013-01-01  65.323793
1     2013-01-02  93.140000
2     2013-01-03  92.970000
3     2013-01-04  93.120000
4     2013-01-07  93.200000
...          ...        ...
1213  2017-08-25  47.650000
1214  2017-08-28  46.400000
1215  2017-08-29  46.460000
1216  2017-08-30  45.960000
1217  2017-08-31  47.260000

[1218 rows x 2 columns]

In [19]:
oil['prices'].mean()

67.71436595744689